tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_rcc.h
/** @defgroup RCC_LL_EC_MCOSOURCE  MCO SOURCE selection
  * @{
  */
#define LL_RCC_MCOSOURCE_NOCLOCK          0x00000000U                            /*!< MCO output disabled, no clock on MCO */
#define LL_RCC_MCOSOURCE_SYSCLK           RCC_CFGR_MCOSEL_0                      /*!< SYSCLK selection as MCO source */
#define LL_RCC_MCOSOURCE_HSI10M           RCC_CFGR_MCOSEL_1                      /*!< HSI10M selection as MCO source */
#define LL_RCC_MCOSOURCE_HSI              (RCC_CFGR_MCOSEL_1| RCC_CFGR_MCOSEL_0) /*!< HSI selection as MCO source */
#if defined(RCC_HSE_SUPPORT)
#define LL_RCC_MCOSOURCE_HSE              RCC_CFGR_MCOSEL_2                      /*!< HSE selection as MCO source */
#endif
#if defined(RCC_PLL_SUPPORT)
#define LL_RCC_MCOSOURCE_PLLCLK           (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_0)  /*!< Main PLL selection as MCO source */
#endif
#define LL_RCC_MCOSOURCE_LSI              (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_1)  /*!< LSI selection as MCO source */
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_MCOSOURCE_LSE              (RCC_CFGR_MCOSEL_2|RCC_CFGR_MCOSEL_1|RCC_CFGR_MCOSEL_0) /*!< LSE selection as MCO source */
#endif
#define LL_RCC_MCOSOURCE_HCLK             RCC_CFGR_MCOSEL_3                      /*!< HCLK selection as MCO source */
#define LL_RCC_MCOSOURCE_PCLK             (RCC_CFGR_MCOSEL_3| RCC_CFGR_MCOSEL_0) /*!< PCLK selection as MCO source */
#define LL_RCC_MCOSOURCE_HCLK_UNGATE      (RCC_CFGR_MCOSEL_3| RCC_CFGR_MCOSEL_1) /*!< HCLK_UNGATE selection as MCO source */
#define LL_RCC_MCOSOURCE_PCLK_UNGATE      (RCC_CFGR_MCOSEL_3| RCC_CFGR_MCOSEL_1 | RCC_CFGR_MCOSEL_0) /*!< PCLK_UNGATE selection as MCO source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO Peripheral MCO get clock source
  * @{
  */
#define LL_RCC_MCO_CLKSOURCE             RCC_CFGR_MCOSEL /*!< MCO Clock source selection */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO_DIV  MCO prescaler
  * @{
  */
#define LL_RCC_MCO_DIV_1                  (0x00000000U)                                                                   /*!< MCO not divided */
#define LL_RCC_MCO_DIV_2                  (RCC_CFGR_MCOPRE_3)                                                             /*!< MCO divided by 2 */
#define LL_RCC_MCO_DIV_4                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_0)                                         /*!< MCO divided by 4 */
#define LL_RCC_MCO_DIV_8                  (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1)                                         /*!< MCO divided by 8 */
#define LL_RCC_MCO_DIV_16                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0)                     /*!< MCO divided by 16 */
#define LL_RCC_MCO_DIV_32                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2)                                         /*!< MCO divided by 32 */
#define LL_RCC_MCO_DIV_64                 (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_0)                     /*!< MCO divided by 64 */
#define LL_RCC_MCO_DIV_128                (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1)                     /*!< MCO divided by 128 */
#define LL_RCC_MCO_DIV_256                (RCC_CFGR_MCOPRE_3 | RCC_CFGR_MCOPRE_2 | RCC_CFGR_MCOPRE_1 | RCC_CFGR_MCOPRE_0) /*!< MCO divided by 256 */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO        0x00000000U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA        0xFFFFFFFFU                 /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

#if defined(RCC_CCIPR_TIMCLK_CTRL)
/** @defgroup RCC_LL_EC_TIM_PCLK_Frequency_Control TIM PCLK Frequency Control
  * @{
  */
#define LL_RCC_TIMPCLK_MUL2               0x00000000U              /*!< TIMER PCLK is twice the system PCLK, but the frequency will not exceed HCLK */
#define LL_RCC_TIMPCLK_MUL1               RCC_CCIPR_TIMCLK_CTRL     /*!< TIMER PCLK is the system PCLK */
/**
  * @}
  */
#endif /* RCC_CCIPR_TIM1SEL */



#if defined(RCC_CCIPR_PVDSEL)
/** @defgroup RCC_LL_EC_PVD_CLKSOURCE Peripheral PVD clock source selection
  * @{
  */
#define LL_RCC_PVD_CLKSOURCE_PCLK1      0x00000000U                   /*!< PCLK1 selected as PVD clock */
#define LL_RCC_PVD_CLKSOURCE_LSC        RCC_CCIPR_PVDSEL              /*!< LSC selected as PVD clock */
/**
  * @}
  */
#endif

#if defined(COMP1)
/** @defgroup RCC_LL_EC_COMPx_CLKSOURCE Peripheral COMP clock source selection
  * @{
  */
#define LL_RCC_COMP1_CLKSOURCE_PCLK1      (RCC_CCIPR_COMP1SEL | (0x00000000U >> 8U))                    /*!< PCLK1 selected as COMP1 clock */
#define LL_RCC_COMP1_CLKSOURCE_LSC        (RCC_CCIPR_COMP1SEL | (RCC_CCIPR_COMP1SEL >> 8U))             /*!< LSC selected as COMP1 clock */
#if defined(COMP2)
#define LL_RCC_COMP2_CLKSOURCE_PCLK1      (RCC_CCIPR_COMP2SEL | (0x00000000U >> 8U))                    /*!< PCLK1 selected as COMP2 clock */
#define LL_RCC_COMP2_CLKSOURCE_LSC        (RCC_CCIPR_COMP2SEL | (RCC_CCIPR_COMP2SEL >> 8U))             /*!< LSC selected as COMP2 clock */
#endif
/**
  * @}
  */
#endif /* COMP1 && COMP2 */

#if defined(RCC_CCIPR_LPUART1SEL)
/** @defgroup RCC_LL_EC_LPUART1x_CLKSOURCE Peripheral LPUART1 clock source selection
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE_PCLK1   (RCC_CCIPR_LPUART1SEL | (0x00000000U >> 8U))
#define LL_RCC_LPUART1_CLKSOURCE_SYSCLK  (RCC_CCIPR_LPUART1SEL | (RCC_CCIPR_LPUART1SEL_0 >> 8U))
#define LL_RCC_LPUART1_CLKSOURCE_LSI     (RCC_CCIPR_LPUART1SEL | (RCC_CCIPR_LPUART1SEL_1 >> 8U))
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_LPUART1_CLKSOURCE_LSE     (RCC_CCIPR_LPUART1SEL | (RCC_CCIPR_LPUART1SEL >> 8U))
#endif
/**
  * @}
  */
#endif /* RCC_CCIPR_LPUART1SEL */


#if defined(RCC_CCIPR_LPTIM1SEL)
/** @defgroup RCC_LL_EC_LPTIMx_CLKSOURCE Peripheral LPTIM clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_PCLK1      (RCC_CCIPR_LPTIM1SEL | (0x00000000U >> 16U))                   /*!< PCLK1 selected as LPTIM1 clock */
#define LL_RCC_LPTIM1_CLKSOURCE_LSI        (RCC_CCIPR_LPTIM1SEL | (RCC_CCIPR_LPTIM1SEL_0 >> 16U))         /*!< LSI selected as LPTIM1 clock */
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_LPTIM1_CLKSOURCE_LSE        (RCC_CCIPR_LPTIM1SEL | (RCC_CCIPR_LPTIM1SEL >> 16U))           /*!< LSE selected as LPTIM1 clock */
#endif
/**
  * @}
  */
#endif /* RCC_CCIPR_LPTIM1SEL */

#if defined(RCC_CCIPR_TIM1SEL)
/** @defgroup RCC_LL_EC_TIM1_CLKSOURCE Peripheral TIM1 clock source selection
  * @{
  */
#define LL_RCC_TIM1_CLKSOURCE_PCLK1     (RCC_CCIPR_TIM1SEL | (0x00000000>>16U))                    /*!< PCLK1 selected as TIM1 clock */
#if defined(RCC_PLL_SUPPORT)
#define LL_RCC_TIM1_CLKSOURCE_PLL       (RCC_CCIPR_TIM1SEL | (RCC_CCIPR_TIM1SEL>>16))              /*!< PLL selected as TIM1 clock */
#endif
/**
  * @}
  */
#endif

#if defined(RCC_CCIPR_TIM17SEL)
/** @defgroup RCC_LL_EC_TIM17_CLKSOURCE Peripheral TIM17 clock source selection
  * @{
  */
#define LL_RCC_TIM17_CLKSOURCE_PCLK1     (RCC_CCIPR_TIM17SEL | (0x00000000>>16U))                   /*!< PCLK1 selected as TIM17 clock */
#if defined(RCC_PLL_SUPPORT)
#define LL_RCC_TIM17_CLKSOURCE_PLL       (RCC_CCIPR_TIM17SEL | (RCC_CCIPR_TIM17SEL>>16))            /*!< PLL selected as TIM17 clock */
#endif
/**
  * @}
  */
#endif

#if defined(RCC_CCIPR_ADCSEL)
/** @defgroup RCC_LL_EC_ADC_CLKSOURCE Peripheral ADC clock source selection
  * @{
  */
#define LL_RCC_ADC_CLKSOURCE_SYSCLK        0x00000000U
#if defined(RCC_PLL_SUPPORT)
#define LL_RCC_ADC_CLKSOURCE_PLL_DIVCLK    RCC_CCIPR_ADCSEL_0
#endif
#define LL_RCC_ADC_CLKSOURCE_HSI           RCC_CCIPR_ADCSEL_1
/**
  * @}
  */
#endif

#if defined(RCC_BDCR_IWDGSEL)
/** @defgroup RCC_LL_EC_IWDG_CLKSOURCE Peripheral IWDG clock source selection
  * @{
  */
#define LL_RCC_IWDG_CLKSOURCE_LSI        0x00000000U
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_IWDG_CLKSOURCE_LSE        RCC_BDCR_IWDGSEL
#endif
/**
  * @}
  */
#endif

#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE          0x00000000U                                        /*!< No clock used as RTC clock */
#if defined(RCC_LSE_SUPPORT)
#define LL_RCC_RTC_CLKSOURCE_LSE          (RCC_BDCR_RTCSEL_0)                                 /*!< LSE oscillator clock used as RTC clock */
#endif
#define LL_RCC_RTC_CLKSOURCE_LSI          (RCC_BDCR_RTCSEL_1)                                 /*!< LSI oscillator clock used as RTC clock */
#if defined(RCC_HSE_SUPPORT)
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV32    (RCC_BDCR_RTCSEL)                                   /*!< HSE oscillator clock divided by 32 used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV128   (RCC_BDCR_RTCSEL | RCC_BDCR_RTC_HSEDIV_SEL_0)       /*!< HSE oscillator clock divided by 128 used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV8     (RCC_BDCR_RTCSEL | RCC_BDCR_RTC_HSEDIV_SEL_1)       /*!< HSE oscillator clock divided by 8 used as RTC clock */
#endif
/**
  * @}
  */
#endif

#if defined(RCC_PLL_SUPPORT)

/** @defgroup RCC_LL_EC_PLL_MUL PLL Multiplicator factor
  * @{
  */
#define LL_RCC_PLL_MUL2                    0x00000000U
#define LL_RCC_PLL_MUL3                    RCC_PLLCFGR_PLLMUL_0
#define LL_RCC_PLL_MUL4                    RCC_PLLCFGR_PLLMUL_1
#define LL_RCC_PLL_MUL5                    (RCC_PLLCFGR_PLLMUL_1 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL6                    RCC_PLLCFGR_PLLMUL_2
#define LL_RCC_PLL_MUL7                    (RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL8                    (RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_1)
#define LL_RCC_PLL_MUL9                    (RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_1 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL10                   RCC_PLLCFGR_PLLMUL_3
#define LL_RCC_PLL_MUL11                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL12                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_1)
#define LL_RCC_PLL_MUL13                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_1 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL14                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_2)
#define LL_RCC_PLL_MUL15                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL16                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_1)
#define LL_RCC_PLL_MUL17                   (RCC_PLLCFGR_PLLMUL_3 | RCC_PLLCFGR_PLLMUL_2 | RCC_PLLCFGR_PLLMUL_1 | RCC_PLLCFGR_PLLMUL_0)
#define LL_RCC_PLL_MUL18                   RCC_PLLCFGR_PLLMUL_4
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL_DIV PLL Div factor
  * @{
  */
#define LL_RCC_PLL_DIV1                    0x00000000U
#define LL_RCC_PLL_DIV2                    RCC_CR_PLLDIV
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLLSOURCE  PLL entry clock source
  * @{
  */
#define LL_RCC_PLLSOURCE_HSI               0x00000000U         /*!< HSI clock selected as PLL entry clock source */
#if defined(RCC_HSE_SUPPORT)               
#define LL_RCC_PLLSOURCE_HSE               RCC_PLLCFGR_PLLSRC  /*!< HSE clock selected as PLL entry clock source */
#endif
/**
  * @}
  */
#endif

#if defined(COMP1)
/** @defgroup RCC_LL_EC_COMP Peripheral COMP get clock source
  * @{
  */
#define LL_RCC_COMP1_CLKSOURCE             RCC_CCIPR_COMP1SEL /*!< COMP1 Clock source selection */
#if defined(COMP2)
#define LL_RCC_COMP2_CLKSOURCE             RCC_CCIPR_COMP2SEL /*!< COMP2 Clock source selection */
#endif /* COMP2 */
/**
  * @}
  */
#endif /* COMP1 */

#if defined(RCC_CCIPR_LPUART1SEL)
/** @defgroup RCC_LL_EC_LPUART1 Peripheral LPUART1 get clock source
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE            RCC_CCIPR_LPUART1SEL /*!< LPUART1 Clock source selection */
/**
  * @}
  */
#endif /* RCC_CCIPR_LPUART1SEL */


#if defined(RCC_CCIPR_LPTIM1SEL)
/** @defgroup RCC_LL_EC_LPTIM Peripheral LPTIM clock source
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE            RCC_CCIPR_LPTIM1SEL /*!< LPTIM1 Clock source selection */
/**
  * @}
  */
#endif /* RCC_CCIPR_LPTIM1SEL */

