tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_rcc.h
/**
  * @brief  Get PVD clock source
  * @rmtoll CCIPR        PVDSEL     LL_RCC_GetCOMPClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PVD_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_PVD_CLKSOURCE_LSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetPVDClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_PVDSEL));
}
#endif

#if defined(COMP1)
/**
  * @brief  Configure COMPx clock source
  * @rmtoll CCIPR        COMPxSEL     LL_RCC_SetCOMPClockSource
  * @param  COMPxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSC
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSC
  * @note   Depending on devices and packages,some COMP may not be available.
  *         Refer to device datasheet for COMP availability.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCOMPClockSource(uint32_t COMPxSource)
{
  MODIFY_REG(RCC->CCIPR, (COMPxSource & 0x0000FF00U), ((COMPxSource & 0xFFU) << 8U));
}

/**
  * @brief  Get COMPx clock source
  * @rmtoll CCIPR        COMPxSEL     LL_RCC_GetCOMPClockSource
  * @param  COMPx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_COMP1_CLKSOURCE_LSC
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_COMP2_CLKSOURCE_LSC
  * @note   Depending on devices and packages,some COMP may not be available.
  *         Refer to device datasheet for COMP availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetCOMPClockSource(uint32_t COMPx)
{
  return (uint32_t)((READ_BIT(RCC->CCIPR, COMPx) >> 8U) | COMPx);
}
#endif /* COMP1 */

#if defined(RCC_CCIPR_LPUART1SEL)
/**
  * @brief  Configure LPUARTx clock source
  * @param  LPUARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  * @note   Depending on devices and packages,some LPUART may not be available.
  *         Refer to device datasheet for LPUART availability.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUARTClockSource(uint32_t LPUARTxSource)
{
  MODIFY_REG(RCC->CCIPR, (LPUARTxSource & 0x0000FF00U), ((LPUARTxSource & 0xFFU) << 8U));
}

/**
  * @brief  Get LPUARTx clock source
  * @param  LPUARTx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  * @note   Depending on devices and packages,some LPUART may not be available.
  *         Refer to device datasheet for LPUART availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(uint32_t LPUARTx)
{
  return (uint32_t)((READ_BIT(RCC->CCIPR, LPUARTx) >> 8U) | LPUARTx);
}
#endif /* RCC_CCIPR_LPUART1SEL */

#if defined(RCC_CCIPR_LPTIM1SEL)
/**
  * @brief  Configure LPTIMx clock source
  * @rmtoll CCIPR        LPTIMxSEL     LL_RCC_SetLPTIMClockSource
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIMClockSource(uint32_t LPTIMxSource)
{
  MODIFY_REG(RCC->CCIPR, (LPTIMxSource & 0xFFFF0000U), (LPTIMxSource << 16U));
}

/**
  * @brief  Get LPTIMx clock source
  * @rmtoll CCIPR        LPTIMxSEL     LL_RCC_GetLPTIMClockSource
  * @param  LPTIMx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(uint32_t LPTIMx)
{
  return (uint32_t)((READ_BIT(RCC->CCIPR, LPTIMx) >> 16U) | LPTIMx);
}
#endif /* RCC_CCIPR_LPTIM1SEL */

/**
  * @brief  Configure TIMx clock source
  * @rmtoll CCIPR        TIMxSEL     LL_RCC_SetTIMClockSource
  * @param  TIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE_PLL
  *         @arg @ref LL_RCC_TIM17_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_TIM17_CLKSOURCE_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTIMClockSource(uint32_t TIMxSource)
{
  MODIFY_REG(RCC->CCIPR, (TIMxSource & 0xFFFF0000U), (TIMxSource << 16U));
}

/**
  * @brief  Get TIMx clock source
  * @rmtoll CCIPR        TIMxSEL     LL_RCC_GetTIMClockSource
  * @param  TIMx This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE
  *         @arg @ref LL_RCC_TIM17_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_TIM1_CLKSOURCE_PLL
  *         @arg @ref LL_RCC_TIM17_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_TIM17_CLKSOURCE_PLL
  * @note   Depending on devices and packages, some clocks may not be available.
  *         Refer to device datasheet for clocks availability.
  */
__STATIC_INLINE uint32_t LL_RCC_GetTIMClockSource(uint32_t TIMx)
{
  return (uint32_t)((READ_BIT(RCC->CCIPR, TIMx) >> 16U) | TIMx);
}

#if defined(RCC_CCIPR_ADCSEL)
/**
  * @brief  Configure ADC clock source
  * @param  ADCSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PLL_DIVCLK
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_HSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADCClockSource(uint32_t ADCSource)
{
  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_ADCSEL, ADCSource);
}

/**
  * @brief  Get ADC clock source
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_SYSCLK
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_PLL_DIVCLK
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CCIPR, RCC_CCIPR_ADCSEL));
}
#endif

#if defined(RCC_BDCR_IWDGSEL)
/**
  * @brief  Configure IWDG clock source
  * @param  IWDGSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_IWDG_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_IWDG_CLKSOURCE_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetIWDGClockSource(uint32_t IWDGSource)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_IWDGSEL, IWDGSource);
}

/**
  * @brief  Get IWDG clock source
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_IWDG_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_IWDG_CLKSOURCE_LSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetIWDGClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_IWDGSEL));
}
#endif

/**
  * @}
  */
#if defined(RTC)
#if defined(RCC_BDCR_RTCSEL)
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @rmtoll BDCR         RTCSEL        LL_RCC_SetRTCClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV8
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL | RCC_BDCR_RTC_HSEDIV_SEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @rmtoll BDCR         RTCSEL        LL_RCC_GetRTCClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_NONE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV32
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV128
  *         @arg @ref LL_RCC_RTC_CLKSOURCE_HSE_DIV8
  */
__STATIC_INLINE uint32_t LL_RCC_GetRTCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL | RCC_BDCR_RTC_HSEDIV_SEL));
}
#endif

/**
  * @brief  Enable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_EnableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Disable RTC
  * @rmtoll BDCR         RTCEN         LL_RCC_DisableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @rmtoll BDCR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCEN) == (RCC_BDCR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Force the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ForceBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ForceBackupDomainReset(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @rmtoll BDCR         BDRST         LL_RCC_ReleaseBackupDomainReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST);
}

/**
  * @}
  */
#endif

#if defined(RCC_PLL_SUPPORT)
/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable PLL
  * @rmtoll CR           PLLON         LL_RCC_PLL_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Disable PLL
  * @note Cannot be disabled if the PLL clock is used as the system clock
  * @rmtoll CR           PLLON         LL_RCC_PLL_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_PLLON);
}

/**
  * @brief  Check if PLL Ready
  * @rmtoll CR           PLLRDY        LL_RCC_PLL_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_PLLRDY) == (RCC_CR_PLLRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Configure PLL used for SYSCLK Domain
  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_ConfigDomain_SYS\n
  *         PLLCFGR      PLLMUL        LL_RCC_PLL_ConfigDomain_SYS\n
  *         CR           PLLDIV        LL_RCC_PLL_ConfigDomain_SYS
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @param  PLLMul This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL_MUL2 
  *         @arg @ref LL_RCC_PLL_MUL3 
  *         @arg @ref LL_RCC_PLL_MUL4 
  *         @arg @ref LL_RCC_PLL_MUL5 
  *         @arg @ref LL_RCC_PLL_MUL6 
  *         @arg @ref LL_RCC_PLL_MUL7 
  *         @arg @ref LL_RCC_PLL_MUL8 
  *         @arg @ref LL_RCC_PLL_MUL9 
  *         @arg @ref LL_RCC_PLL_MUL10
  *         @arg @ref LL_RCC_PLL_MUL11
  *         @arg @ref LL_RCC_PLL_MUL12
  *         @arg @ref LL_RCC_PLL_MUL13
  *         @arg @ref LL_RCC_PLL_MUL14
  *         @arg @ref LL_RCC_PLL_MUL15
  *         @arg @ref LL_RCC_PLL_MUL16
  *         @arg @ref LL_RCC_PLL_MUL17
  *         @arg @ref LL_RCC_PLL_MUL18
  * @param  PLLDiv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL_DIV1 
  *         @arg @ref LL_RCC_PLL_DIV2 
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_ConfigDomain_SYS(uint32_t Source, uint32_t PLLMul,uint32_t PLLDiv)
{
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC | RCC_PLLCFGR_PLLMUL, Source | PLLMul);
  MODIFY_REG(RCC->CR,RCC_CR_PLLDIV,PLLDiv);
}

/**
  * @brief  Configure PLL clock source
  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_SetMainSource
  * @param PLLSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMainSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @rmtoll PLLCFGR      PLLSRC        LL_RCC_PLL_GetMainSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMainSource(void)
{
  return (uint32_t)(READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC));
}

/**
  * @brief  Configure PLL Multiplication Factor.
  * @rmtoll PLLCFGR      PLLMUL        LL_RCC_PLL_SetMulFactor
  * @param PLLMul This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL_MUL2 
  *         @arg @ref LL_RCC_PLL_MUL3 
  *         @arg @ref LL_RCC_PLL_MUL4 
  *         @arg @ref LL_RCC_PLL_MUL5 
  *         @arg @ref LL_RCC_PLL_MUL6 
  *         @arg @ref LL_RCC_PLL_MUL7 
  *         @arg @ref LL_RCC_PLL_MUL8 
  *         @arg @ref LL_RCC_PLL_MUL9 
  *         @arg @ref LL_RCC_PLL_MUL10
  *         @arg @ref LL_RCC_PLL_MUL11
  *         @arg @ref LL_RCC_PLL_MUL12
  *         @arg @ref LL_RCC_PLL_MUL13
  *         @arg @ref LL_RCC_PLL_MUL14
  *         @arg @ref LL_RCC_PLL_MUL15
  *         @arg @ref LL_RCC_PLL_MUL16
  *         @arg @ref LL_RCC_PLL_MUL17
  *         @arg @ref LL_RCC_PLL_MUL18
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetMulFactor(uint32_t PLLMul)
{
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLLMUL, PLLMul);
}

/**
  * @brief  Get PLL multiplication Factor
  * @rmtoll PLLCFGR      PLLMUL        LL_RCC_PLL_GetMultiplicator
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL_MUL2 
  *         @arg @ref LL_RCC_PLL_MUL3 
  *         @arg @ref LL_RCC_PLL_MUL4 
  *         @arg @ref LL_RCC_PLL_MUL5 
  *         @arg @ref LL_RCC_PLL_MUL6 
  *         @arg @ref LL_RCC_PLL_MUL7 
  *         @arg @ref LL_RCC_PLL_MUL8 
  *         @arg @ref LL_RCC_PLL_MUL9 
  *         @arg @ref LL_RCC_PLL_MUL10
  *         @arg @ref LL_RCC_PLL_MUL11
  *         @arg @ref LL_RCC_PLL_MUL12
  *         @arg @ref LL_RCC_PLL_MUL13
  *         @arg @ref LL_RCC_PLL_MUL14
  *         @arg @ref LL_RCC_PLL_MUL15
  *         @arg @ref LL_RCC_PLL_MUL16
  *         @arg @ref LL_RCC_PLL_MUL17
  *         @arg @ref LL_RCC_PLL_MUL18
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetMultiplicator(void)
{
  return (uint32_t)(READ_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLLMUL));
}


/**
  * @brief  Configure PLL Div Factor.
  * @rmtoll CR      PLLDIV        LL_RCC_PLL_SetDivFactor
  * @param PLLDiv This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL_DIV1 
  *         @arg @ref LL_RCC_PLL_DIV2 
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL_SetDivFactor(uint32_t PLLDiv)
{
  MODIFY_REG(RCC->CR, RCC_CR_PLLDIV, PLLDiv);
}

/**
  * @brief  Get PLL Div Factor
  * @rmtoll CR      PLLDIV        LL_RCC_PLL_GetDivFactor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL_DIV1 
  *         @arg @ref LL_RCC_PLL_DIV2 
  */
__STATIC_INLINE uint32_t LL_RCC_PLL_GetDivFactor(void)
{
  return (uint32_t)(READ_BIT(RCC->CR, RCC_CR_PLLDIV));
}
/**
  * @}
  */
#endif


